---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeEndtreatmentStartType
source: html/59df983d-92f4-348b-8b43-28ea0bc43072.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeEndtreatmentStartType Property

"End Treatment At Start"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeEndtreatmentStartType { get; }
```